Repository: TsegaCS/etrss-1
Catalog: locale/*/LC_MESSAGES/django.po
Languages: am

source: English
am: እንግሊዝኛ

source: Amharic
am: አማርኛ

source: ESSTI has now begun to process your custom demands or just choose from our archieves!
am: ESSTI የእርስዎን የሳተላይት ምስል ጥያቄ ወይም ካለን የክምችት ክፍል ውስጥ ማቅረብ ጀምሯል!

source: Visit Our Works
am: ስራዎችንን ይመልከቱ

source: Services
am: አገልግሎታችን

source: With our own remote-sensing satellite ETRSS-1 and our veteran experts we can deliver the best satellite image products.
am: የራሳችን የመሬት-ምልከታ ሳተላይት በሆነችው ETRSS-1 እና በሙያው ጥልቅ እውቀት ባላቸው ባለሙያዎቻችን የርስዎን የሳተላይት ምስል ፍላጎት እናሟላለን።

source: Archived Satellite Images
am: ክምችት ክፍላችን ውስጥ ያሉ የሳተላይት ምስሎች

source: You can choose from our plethora of archived satellite images which are for sale at a very affordable price.
am: ክምችት ክፍላችን ውስጥ ካሉት ለእርስዎ የሚጠቅምዎትን የሳተላይት ምስሎች በተመጣጣኝ ዋጋ ለሽያጭ አቅርበናል።

source: Custom Request
am: የግል ጥያቄ

source: You can also get your own satellite image of any place by filling out the ETRSS-1 custom request form which is prepared just for your inquiry!
am: ለእርስዎ ስራ ወይም ፕሮጀክት የሚጠቅምዎትን የሳተላይት ምስሎች ለዚህ ተብሎ በተዘጋጀው የETRSS-1 መጠየቂያ ፎርም በመሙላት ማግኘት ይችላሉ!

source: Visit our works
am: ስራዎችንን ይጎብኙ

source: Navigate through our previous works and our service for organizations, researchers and enterprises.
am: ከዚህ ቀደም ለተለያዩ ተመራማሪዎች፣ መንግስታዊና መንግስታዊ ላልሆኑ ድርጅቶች የሰራናቸውን ስራዎችን እና የተለያዩ አገልግሎቶቻችንን ይመልከቱ።

source: Featured Works
am: የተመረጡ ስራዎችንን

source: Here are some of our high-quality satellite images that we worked on so far.
am: እነዚህ በክፍተኛ ጥንቃቄና ጥራት የተሰሩ የሳተላይት ምስል ምርቶቻችን ናቸው።

source: From: Archives
am: ከ፡ ክምችት ክፍላችን

source: Lake Tana
am: የጣና ሀይቅ

source: Visit our archives
am: የክምችት ክፍላችንን ይጎብኙ

source: Lake Abaya and Chamo
am: አባያና ጫሞ ሀይቆች

source: Dahlak Island, Eritrea
am: ዳህላክ ደሴት፣ ኤርትራ

source: Thailand
am: ታይላንድ

source: Boanamary, Madagascar
am: ቦአናሜሪ፣ ማዳጋስካር

source: Our Creative Team
am: አመራሮቻችን እና ባለሙያዎቻችን

source: Take a look at some of our leaders and team members.
am: አንዳንድ አመራሮቻችንን እና ባለሙያዎቻችንን ይተዋውቁ

source: Dr. Solomon Belay
am: ዶ/ር ሰለሞን በላይ

source: Director General
am: ዋና ዳይሬክተር

source: Mr. Abdissa Yilma
am: አቶ አብዲሳ ይልማ

source: Deputy Director General
am: ም/ዋና ዳይሬክተር

source: Mr. Yilkal Chane
am: አቶ ይልቃል ጫኔ

source: Head Department of Satellite Operation
am: የሳተላይት ምርምርና ልማት ዳይሬክተር

source: Software Engineer
am: ሶፍትዌር ኤንጅኒየር

source: About
am: ስለእኛ

source: Portfolio
am: ስራዎችንን

source: Contact
am: ያግኙን

source: Welcome to our Archives! Best of ETRSS-1 satellite image products delivered for any of your needs!
am: እንኳን በደህና መጡ!

source: Request our products
am: ምርቶቻችንን ያግኙ

source: Archived Works
am: ክምችት ክፍላችን ውስጥ ያሉ

source: Welcome
am: ሰላም

source: Request
am: ይጠይቁ

source: ETRSS-1 Satellite Product Request Portal
am: የETRSS-1 ሳተላይት ምስል ምርቶች መጠየቂያ ፖርታል

source: home
am: መግቢያ

source: ETRSS-1 product request
am: የ ETRSS-1 ሳተላይት ምስል ምርቶች መጠየቂያ

source: New Request
am: አዲስ ጥያቄ

source: From Archive
am: ከክምችት ክፍላችን

source: Hi
am: ሰላም

source: Logout
am: መውጪያ

source: Register
am: ይመዝገቡ

source: Login
am: ይግቡ
